% Моделювання посадки на Місяць рятувальної капсули,
% що пілотується у ручному режимі
% Пілот (ви) можети лише вмикати або вимикати ракетний двигун
% в певні моменти часу (змінюючи стан змінної u=0 або u=1

% Константи

% Прискорення вільного падіння Місяця м/с2
gl = 1.62
% обмеження по максимально допустимому перевантаженню м/с2
g = 9.81
Gmax = 3*g

% Характеристики рятувальної капсули

% маса посадкового модуля без палива кг
m0 = 2300
% маса палива кг
mt = 400

%  Висота початку посадки [м]
H0=2200
%  Початкова вертикальна швидкість м/с
V0 = 0

% Швидкість витікання струменя ракетного двигуна [м/с]
vt=3600
% масовий розхід палива кг/с
dmt = 22

% Кінцеві умови успішної посадки
Hmin = 3 % Відхилення висоти для завершення посадки
Vmin = 3 % Максимальна швидкість у момент посадки


% Початкові умови моделювання
dt = 0.01 % дискретність часу
t = 0     % початковий час
H = H0    % Поточна висота
V = V0    % Поточна швидкість
A = -gl    % Поточне прискорення
u=0; % 0 або 1

% Змінні для збереження проміжних результатів
Hlog=H;
Vlog=V;
Alog=A;
Tlog=t;
Mlog=mt;

for i=1:round(100/dt),
  
  % Закон керування двигуном
  % Тут ви можете змінювати умови
  % для ввімкнення або вимкнення двигуна
  if (t>=50.63)
    u=1;
  end;
  
 
  % Поточна повна маса рятовальної капсули
  m = m0+mt;
  % Гравітаційна сила, що діє на капсулу
  Fg = m*gl;
  
  % Обрахунок витрати палива
  % якщо паливо скінчилося, то тяга дорівнює 0
  mt = mt-dmt*dt*u;
  if mt <= 0,
    mt = 0; 
    Fr = 0;
  else
    Fr = dmt*vt*u;
  end;
  
  % Рівняння сил, що діють на капсулу
  Fi  = Fr - Fg;
  % Прискорення з яким рухається капсула
  A = Fi / m;
  % Швидкість з якою рухається капсула
  V = V + A*dt;  
  % Поточна висота польоту
  H = H + V*dt;
  % Приріст часу
  t = t + dt;

  % Збереження проміжних результатів
  Hlog=[Hlog;H];
  Vlog=[Vlog;V];
  Alog=[Alog;A];
  Mlog=[Mlog;mt];
  Tlog=[Tlog;t];

  % Умови припинення моделювання посадки
  % Ви досягли місячної поверхні
  if (H<=Hmin) break; end;
  % Ви втратили керування внаслідок перевантаження
  if (abs(A)>Gmax) break; end;

end
err=false;
if (abs(V)>Vmin)
  disp(["Занадто висока швидкість посадки : " , num2str(V)]);
  err=true;
end

if (abs(A)>Gmax)
  disp(["Занадто велике перевантаження :" num2str(A)]);
  err=true;
endif

disp(["Поточна висота : " , num2str(H)]);
disp(["Поточна швидкість : " , num2str(V)]);

disp("Результат:");
if err,
  disp(["Ви розбилися при посадці"]);
else
  disp(["Посадка була вдалою"]);
end



figure(1)

subplot(2,2,1);
plot(Tlog,Hlog,[Tlog(1);Tlog(end)],[Hmin -Hmin;Hmin -Hmin]);
xlabel("Час, с");
ylabel("Висота H, м");
grid on;

subplot(2,2,2);
plot(Tlog,Vlog,[Tlog(1);Tlog(end)],[Vmin -Vmin;Vmin -Vmin]);
xlabel("Час, с");
ylabel("Швидкість V, м");
grid on;

subplot(2,2,3);
plot(Tlog,Alog,[Tlog(1);Tlog(end)],[Gmax;Gmax]);
xlabel("Час, с");
ylabel("Прискорення A, м/c2");
grid on;
subplot(2,2,4);
plot(Tlog,Mlog);
xlabel("Час, с");
ylabel("Залишок палива Mt, кг");
grid on;
