function dx=dc_motor(t, x)
  % Електричні постійні
  Ki=0.0191;
  Ke=Ki;
  % Момент інерції ротора
  Jr=155.4/1000/(100^2);
  % Опір, що створюється силою тертя на валу
  Bv=0.02;
  % Опір якоря
  R=0.60;
  % Індуктивність якоря
  L=0.35e-3;
  % Напруга живлення
  V=12;
  
  % Колесо
  % Радіус
  Rw = 0.050;
  % Маса
  Mw = 1.000;
  % Момент інерції колеса
  Jk = 1/2*Mw*(Rw^2);
  
  % Момент інерції двигуна з колесом
  J=Jr+Jk;
  
  % струм двигуна
  I = x(1);
  % оберти двигуна
  w = x(2);
    
  % Функція керування 
  % у момент часу 1с вмикаємо напругу
  % у момент часу 2с вимикаємо напругу
  u = 0;
  if(t>1) 
    u=V;
  end;
  
  if (t>2) 
    u=0;
  end;
  
  % Система рівнянь, що описують модель двигуна
  
  % Рівняння стану по струму
  % L (di/dt) + R*i = U - Ke*w
  di = (-R/L)*I + (-Ke/L)*w + (1/L)*u;
    
  % Рівняння по обертам
  % J (dw/dt) + Bv*w = Ki*i
  dw = (Ki/J)*I + (-Bv/J)*w;
  
  % Приріст функції у формі Коші
  dx = [di;dw];
  
