function dx=dc_motor_pi(t, x)
  % Електричні постійні
  Ki=0.0191;
  Ke=Ki;
  % Момент інерції ротора
  Jr=155.4/1000/(100^2);
  % Опір, що створюється силою тертя на валу
  Bv=0.02;
  % Опір якоря
  R=0.60;
  % Індуктивність якоря
  L=0.35e-3;
  % Напруга живлення
  V=12;
  
  % Колесо
  % Радіус
  Rw = 0.050;
  % Маса
  Mw = 1.000;
  % Момент інерції колеса
  Jk = 1/2*Mw*(Rw^2);
  
  % Момент інерції двигуна з колесом
  J=Jr+Jk;
  
  % струм двигуна
  I = x(1);
  % оберти двигуна
  w = x(2);
  % сигнал керування
  u = x(3);

  % Гравітаційні сили
  % На марсі
  gravity = 3.711;
  % На землі
  % gravity = 9.807;
  
  % Момент визваний тертям колеса об поверхню
  % Коефіціент тертя
  utr = 0.5;
  % Момент що створюється силою тертя
  Mtr = 0;
  if (t>2),
    Mtr = utr*Mw*gravity*Rw;
  end;
  
  % Система рівнянь, що описують модель двигуна
    
  % Рівняння стану по струму
  % L (di/dt) + R*i = U - Ke*w
  di = (-R/L)*I + (-Ke/L)*w + (1/L)*u;

  % Рівняння по обертам
  % J (dw/dt) + Bv*w + Mtr = Ki*i
  dw = (Ki/J)*I + (-Bv/J)*w + (-Mtr/J);
  
  % Рівняння ПИ контроллера
  w0=0;
  if (t>1)
    w0=10; % Задана швидкість
  end;
  Kw=10; % Коефіціент керування по швидкості
  Kdw=0.10; % Коефіціент керування по прискоренню
  du=Kw*(w0-w)-Kdw*dw;
  
  % Приріст функції у формі Коші
  dx = [di;dw;du];
  
